#ifndef _BSP_IWDG_H
#define _BSP_IWDG_H


///////////////////////////////////////
/* 头文件包含区 */
#include "sys.h"
///////////////////////////////////////
/* 宏定义区域 */

///////////////////////////////////////
/* 外部变量申明区 */

/*描述 ：独立看门狗初始化*/
void bsp_InitIwdg(uint8_t _uIWDGPrer,uint32_t _u1IWDGR1r);

/*描述 ：喂独立看门狗*/
void IWDG_Feed(void);
///////////////////////////////////////
/* 函数申明区 */

///////////////////////////////////////
#endif

/***************************** 德致伦电子 DeZLinc (END OF FILE) *********************************/
